#### PageOrientationType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Page Orientation types of Print Setting

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum PageOrientationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PageOrientationType ``` |

| Visual C++ |
| --- |
| ``` public enum class PageOrientationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Portrait | The type of Page Orientation is Portrait |
| Landscape | The type of Page Orientation is Landscape |
| Auto | Auto Page Orientation |

# See Also

Autodesk.Revit.DB Namespace